app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `username` = 'it@chakanoks.com'
OR `email` = 'it@chakanoks.com'
---
    public function loginAuth()
    {
        helper(['form', 'url']);
        $db = Database::connect();

        $username = trim($this->request->getPost('username'));
        $password = trim($this->request->getPost('password'));

        // Look for the user in the users table
        $builder = $db->table('users');
        $user = $builder->where('username', $username)
                        ->orWhere('email', $username)
                        ->get()
                        ->getRow();