app/Controllers/Branch.php

SELECT *
FROM `branch_inventory`
WHERE `branch_id` IS NULL
---
    public function monitorInventory()
    {
        $db = Database::connect();
        $branchId = session()->get('branch_id');

        $inventory = $db->table('branch_inventory')
                        ->where('branch_id', $branchId)
                        ->get()
                        ->getResultArray();

SELECT *
FROM `transfers`
WHERE `to_branch` IS NULL
---
    public function approveTransfers()
    {
        $db = Database::connect();
        $branchId = session()->get('branch_id');
        $transfers = $db->table('transfers')->where('to_branch', $branchId)->get()->getResultArray();