app/Controllers/Central_AD.php

SELECT *
FROM `inventory`
ORDER BY `updated_at` DESC
SELECT *
FROM `inventory`
SELECT SUM(`quantity`) AS `quantity`
FROM `inventory`
SELECT COUNT(*) AS `numrows`
FROM `inventory`
WHERE   (
`status` = 'available'
OR `status` = 'low_stock'
 )
AND   (
`expiry_date` >= '2025-12-01'
OR expiry_date IS NULL
OR `expiry_date` = ''
 )
SELECT COUNT(*) AS `numrows` FROM `inventory`
---
    public function inventory()
    {
        // Get all inventory items ordered by most recently updated
        $data['inventory'] = $this->inventoryModel
            ->orderBy('updated_at', 'DESC')
            ->findAll();

        // Get summary statistics
        $db = \Config\Database::connect();
        $totalQuantityResult = $db->table('inventory')->selectSum('quantity')->get()->getRow();

        // Count available items (including low stock items as available, but excluding expired items)
        $today = date('Y-m-d');
        $availableItems = $db->table('inventory')
            ->groupStart()
                ->where('status', 'available')
                ->orWhere('status', 'low_stock')
            ->groupEnd()
            ->groupStart()
                ->where('expiry_date >=', $today)
                ->orWhere('expiry_date IS NULL', null, false)
                ->orWhere('expiry_date', '')
            ->groupEnd()
            ->countAllResults();

        $data['stats'] = [
            'totalItems' => $this->inventoryModel->countAll(),
            'totalQuantity' => $totalQuantityResult->quantity ?? 0,
            'availableItems' => $availableItems,
            'expiringSoon' => count($this->inventoryModel->getExpiringSoon(7)),
        ];

SELECT COUNT(*) AS `numrows` FROM `inventory`
SELECT *
FROM `suppliers`
SELECT *
FROM `purchase_orders`
---
    public function reports()
    {
        $inventoryModel = new \App\Models\InventoryModel();
        $supplierModel = new \App\Models\SupplierModel();
        $purchaseOrderModel = new \App\Models\PurchaseOrderModel();

        $data['totalInventory'] = $inventoryModel->countAll();
        $data['lowStockItems'] = $inventoryModel->getLowStockItems();
        $data['expiredItems'] = $inventoryModel->getExpiredItems();
        $data['supplierPerformance'] = [];

        $suppliers = $supplierModel->findAll();
        foreach ($suppliers as $supplier) {
            $data['supplierPerformance'][] = array_merge(
                ['supplier_name' => $supplier['supplier_name']],
                $supplierModel->getSupplierPerformance($supplier['id'])
            );
        }

        $data['purchaseOrders'] = $purchaseOrderModel->findAll();