app/Controllers/Central_AD.php

SELECT *
FROM `suppliers`
---
    public function suppliers()
    {
        $data['suppliers'] = $this->supplierModel->findAll();

SELECT `purchase_orders`.*, `suppliers`.`supplier_name`, `branches`.`name` as `branch_name`
FROM `purchase_orders`
JOIN `suppliers` ON `suppliers`.`id` = `purchase_orders`.`supplier_id`
JOIN `branches` ON `branches`.`id` = `purchase_orders`.`branch_id`
---
    public function orders()
    {
        $purchaseOrderModel = new \App\Models\PurchaseOrderModel();
        $data['orders'] = $purchaseOrderModel->select('purchase_orders.*, suppliers.supplier_name, branches.name as branch_name')
            ->join('suppliers', 'suppliers.id = purchase_orders.supplier_id')
            ->join('branches', 'branches.id = purchase_orders.branch_id')
            ->findAll();

SELECT *
FROM `branches`
SELECT *
FROM `suppliers`
---
    public function createOrder()
    {
        $branchModel = new \App\Models\BranchModel();
        $supplierModel = new \App\Models\SupplierModel();

        $data['branches'] = $branchModel->findAll();
        $data['suppliers'] = $supplierModel->findAll();