app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `inventory`
WHERE `quantity` < 5
SELECT COUNT(*) AS `numrows` FROM `suppliers`
SELECT *
FROM `inventory`
ORDER BY `updated_at` DESC
 LIMIT 5
---
    public function index()
    {
        if (! session()->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'You must be logged in.');
        }

        $role = session()->get('role');
        $userId = session()->get('user_id');

        $data = [
            'role' => $role,
            'username' => session()->get('username'),
            'alerts' => [
                'success' => session()->getFlashdata('success'),
                'error' => session()->getFlashdata('error'),
                'warning' => session()->getFlashdata('warning'),
                'info' => session()->getFlashdata('info'),
            ],
        ];

        if ($role === 'admin') {
            $inventoryModel = new InventoryModel();
            $supplierModel = new SupplierModel();

            $data['metrics'] = [
                'totalItems' => $inventoryModel->countAll(),
                'lowStock' => $inventoryModel->where('quantity <', 5)->countAllResults(),
                'suppliers' => $supplierModel->countAll(),
            ];
            $data['recentItems'] = $inventoryModel->orderBy('updated_at', 'DESC')->findAll(5);

SELECT COUNT(*) AS `numrows`
FROM `transfers`
WHERE `to_branch` IS NULL
AND `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `branch_inventory`
WHERE `branch_id` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `purchase_requests`
WHERE `branch_id` IS NULL
SELECT *
FROM `branch_inventory`
WHERE `branch_id` IS NULL
ORDER BY `updated_at` DESC
 LIMIT 5
SELECT `item_name`, `quantity`
FROM `branch_inventory`
WHERE `branch_id` IS NULL
AND `quantity` < 5
SELECT 'Transfer' as type, CONCAT('Transfer of ', `quantity`, ' ', `item_name`, ' from branch ', from_branch) as description, `created_at`
FROM `transfers`
WHERE `to_branch` IS NULL
OR `from_branch` IS NULL
ORDER BY `created_at` DESC
 LIMIT 3
SELECT 'Purchase Request' as type, CONCAT('Requested ', `quantity`, ' ', item_name) as description, `created_at`
FROM `purchase_requests`
WHERE `branch_id` IS NULL
ORDER BY `created_at` DESC
 LIMIT 2
---

            $data['metrics'] = [
                'branchInventoryCount' => $db->table('branch_inventory')->where('branch_id', $branchId)->countAllResults(),
                'pendingTransfers' => $db->table('transfers')->where('to_branch', $branchId)->where('status', 'pending')->countAllResults(),
                'purchaseRequests' => $db->table('purchase_requests')->where('branch_id', $branchId)->countAllResults(),
            ];
            $data['inventory'] = $db->table('branch_inventory')
                ->where('branch_id', $branchId)
                ->orderBy('updated_at', 'DESC')
                ->limit(5)
                ->get()->getResultArray();

            // Low Stock Alerts: items with quantity < 5
            $data['lowStockAlerts'] = $db->table('branch_inventory')
                ->select('item_name, quantity')
                ->where('branch_id', $branchId)
                ->where('quantity <', 5)
                ->get()->getResultArray();

            // Activity Log: recent transfers and purchase requests
            $transfers = $db->table('transfers')
                ->select("'Transfer' as type, CONCAT('Transfer of ', quantity, ' ', item_name, ' from branch ', from_branch) as description, created_at")
                ->where('to_branch', $branchId)
                ->orWhere('from_branch', $branchId)
                ->orderBy('created_at', 'DESC')
                ->limit(3)
                ->get()->getResultArray();

            $requests = $db->table('purchase_requests')
                ->select("'Purchase Request' as type, CONCAT('Requested ', quantity, ' ', item_name) as description, created_at")
                ->where('branch_id', $branchId)
                ->orderBy('created_at', 'DESC')
                ->limit(2)
                ->get()->getResultArray();