app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `branches`
SELECT COUNT(*) AS `numrows`
FROM `purchase_requests`
WHERE `status` = 'pending'
---
                'totalItems' => $inventoryModel->countAll(),
                'lowStock' => $lowStockCount,
                'suppliers' => $supplierModel->countAll(),
                'totalBranches' => $branchModel->countAll(),
                'pendingPurchaseRequests' => $db->table('purchase_requests')->where('status', 'pending')->countAllResults(),

SELECT *
FROM `inventory`
ORDER BY `updated_at` DESC
 LIMIT 5
SELECT `purchase_requests`.*, `branches`.`name` as `branch_name`
FROM `purchase_requests`
JOIN `branches` ON `branches`.`id` = `purchase_requests`.`branch_id`
WHERE `purchase_requests`.`status` = 'pending'
ORDER BY `purchase_requests`.`created_at` DESC
 LIMIT 5
---
                'readyForDelivery' => $purchaseOrderModel->where('status', 'ready_for_delivery')->countAllResults(),
                'scheduledDeliveries' => $deliveryModel->where('status', 'scheduled')->countAllResults(),
            ];
            $data['recentItems'] = $inventoryModel->orderBy('updated_at', 'DESC')->findAll(5);
            $data['pendingPurchaseRequests'] = $db->table('purchase_requests')
                ->select('purchase_requests.*, branches.name as branch_name')
                ->join('branches', 'branches.id = purchase_requests.branch_id')
                ->where('purchase_requests.status', 'pending')
                ->orderBy('purchase_requests.created_at', 'DESC')
                ->limit(5)
                ->get()->getResultArray();

SELECT COUNT(*) AS `numrows` FROM `inventory`
SELECT *
FROM `inventory`
ORDER BY `updated_at` DESC
 LIMIT 5
---
            $lowStockItems = $inventoryModel->getLowStockItems(5);
            $lowStockCount = count($lowStockItems);

            $data['metrics'] = [
                'stockCount' => $inventoryModel->countAll(),
                'lowStock' => $lowStockCount,
            ];
            $data['recentItems'] = $inventoryModel->orderBy('updated_at', 'DESC')->findAll(5);