app/Controllers/Inventory.php

    public function dashboard()
    {
        $inventoryModel = new InventoryModel();

        $data['stockCount']  = $inventoryModel->countAll();
        $data['lowStock']    = $inventoryModel->where('quantity <', 5)->countAllResults();
        $data['recentItems'] = $inventoryModel->orderBy('updated_at', 'DESC')->findAll(5);
---
SELECT COUNT(*) AS `numrows` FROM `inventory`
SELECT COUNT(*) AS `numrows`
FROM `inventory`
WHERE `quantity` < 5
SELECT *
FROM `inventory`
ORDER BY `updated_at` DESC
 LIMIT 5


            // Insert new item
            if ($inventoryModel->save($data)) {
                return redirect()->to(site_url('inventory/stock-list'))->with('success', 'Item added successfully!');
---
SELECT *
FROM `inventory`

    public function stockList()
    {
        $inventoryModel = new InventoryModel();
        $data['items'] = $inventoryModel->orderBy('updated_at', 'DESC')->findAll();
---
SELECT *
FROM `inventory`
ORDER BY `updated_at` DESC