app/Controllers/LogisticsController.php

    public function dashboard()
    {
        // Only logistics_coordinator role can access
        if (!session()->get('logged_in') || session()->get('role') !== 'logistics_coordinator') {
            return redirect()->to('/')->with('error', 'Unauthorized access. Logistics coordinator access only.');
        }

        // Get orders ready for delivery
        $data['readyOrders'] = $this->purchaseOrderModel
            ->select('purchase_orders.*, suppliers.supplier_name, branches.name as branch_name')
            ->join('suppliers', 'suppliers.id = purchase_orders.supplier_id')
            ->join('branches', 'branches.id = purchase_orders.branch_id')
            ->where('purchase_orders.status', 'ready_for_delivery')
            ->orderBy('purchase_orders.prepared_at', 'ASC')
            ->findAll();

        $data['readyOrdersCount'] = count($data['readyOrders']);

        // Get scheduled deliveries with order details
        $data['scheduledDeliveries'] = $this->deliveryModel
            ->select('deliveries.*, purchase_orders.item_name, branches.name as branch_name')
            ->join('purchase_orders', 'purchase_orders.id = deliveries.order_id')
            ->join('branches', 'branches.id = purchase_orders.branch_id')
            ->where('deliveries.status', 'scheduled')
            ->orderBy('deliveries.scheduled_date', 'ASC')
            ->findAll();

        $data['scheduledCount'] = count($data['scheduledDeliveries']);
        $data['totalDeliveries'] = $this->deliveryModel->countAll();
        $data['completedToday'] = $this->deliveryModel
            ->where('status', 'delivered')
            ->where('DATE(actual_date)', date('Y-m-d'))
            ->countAllResults();
---
SELECT `purchase_orders`.*, `suppliers`.`supplier_name`, `branches`.`name` as `branch_name`
FROM `purchase_orders`
JOIN `suppliers` ON `suppliers`.`id` = `purchase_orders`.`supplier_id`
JOIN `branches` ON `branches`.`id` = `purchase_orders`.`branch_id`
WHERE `purchase_orders`.`status` = 'ready_for_delivery'
ORDER BY `purchase_orders`.`prepared_at` ASC
SELECT `deliveries`.*, `purchase_orders`.`item_name`, `branches`.`name` as `branch_name`
FROM `deliveries`
JOIN `purchase_orders` ON `purchase_orders`.`id` = `deliveries`.`order_id`
JOIN `branches` ON `branches`.`id` = `purchase_orders`.`branch_id`
WHERE `deliveries`.`status` = 'scheduled'
ORDER BY `deliveries`.`scheduled_date` ASC
SELECT COUNT(*) AS `numrows` FROM `deliveries`
SELECT COUNT(*) AS `numrows`
FROM `deliveries`
WHERE `status` = 'delivered'
AND DATE(actual_date) = '2025-12-01'