app/Models/InventoryModel.php

    public function getLowStockItems($threshold = 5)
    {
        // Use DB builder directly to ensure clean query
        // Get items with low quantity (<= threshold) OR status 'low_stock'
        // Exclude out of stock items
        return $this->db->table($this->table)
                    ->groupStart()
                        ->groupStart()
                            ->where('quantity <=', $threshold)
                            ->where('quantity >', 0)
                        ->groupEnd()
                        ->orWhere('status', 'low_stock')
                    ->groupEnd()
                    ->where('status !=', 'out_of_stock')
                    ->get()
                    ->getResultArray();
---
SELECT *
FROM `inventory`
WHERE   (
   (
`quantity` <= 5
AND `quantity` > 0
  )
OR `status` = 'low_stock'
 )
AND `status` != 'out_of_stock'

    public function getExpiredItems()
    {
        // Use DB builder directly to ensure clean query
        return $this->db->table($this->table)
                    ->where('expiry_date <', date('Y-m-d'))
                    ->where('expiry_date IS NOT NULL')
                    ->where('expiry_date !=', '')
                    ->get()
                    ->getResultArray();
---
SELECT *
FROM `inventory`
WHERE `expiry_date` < '2025-12-01'
AND `expiry_date` IS NOT NULL
AND `expiry_date` != ''

    public function getExpiringSoon($days = 7)
    {
        // Use DB builder directly to ensure clean query
        $today = date('Y-m-d');
        $futureDate = date('Y-m-d', strtotime("+$days days"));
        return $this->db->table($this->table)
                    ->where('expiry_date <=', $futureDate)
                    ->where('expiry_date >=', $today)
                    ->where('expiry_date IS NOT NULL')
                    ->where('expiry_date !=', '')
                    ->get()
                    ->getResultArray();
---
SELECT *
FROM `inventory`
WHERE `expiry_date` <= '2025-12-08'
AND `expiry_date` >= '2025-12-01'
AND `expiry_date` IS NOT NULL
AND `expiry_date` != ''